# InvalidSpareLoad Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricityFailures..::..InvalidSpareLoad Property
BuiltInFailures..::..ElectricityFailures Class See Also
---
The spare/space assigned to panel '[Panel Name]' has an invalid load property. To correct this issue, remove and add the spare/space to the panel again.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidSpareLoad { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidSpareLoad As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidSpareLoad {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricityFailures Class
Autodesk.Revit.DB Namespace